REASON_CODES = {
    5001: 'Отказ эмитента проводить онлайн операцию. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5005: 'Отказ эмитента без объяснения причин. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5006: '''
        Отказ сети проводить операцию или неправильный CVV код.
        Проверьте правильность введенных данных карты или воспользуйтесь другой картой
    ''',
    5007: 'Карта потеряна. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5012: '''
        Карта не предназначена для онлайн платежей.
        Воспользуйтесь другой картой или свяжитесь с банком, выпустившим карту'
    ''',
    5013: 'Слишком маленькая или слишком большая сумма операции. Проверьте корректность суммы',
    5014: '''
        Некорректный номер карты. Проверьте правильность введенных данных карты или воспользуйтесь другой картой
    ''',
    5030: 'Ошибка на стороне эквайера — неверно сформирована транзакция. Повторите попытку позже',
    5031: 'Неизвестный эмитент карты. Воспользуйтесь другой картой',
    5034: 'Отказ эмитента — подозрение на мошенничество. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5041: 'Карта потеряна. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5043: 'Карта украдена. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5051: 'Недостаточно средств на карте',
    5054: '''
        Карта просрочена или неверно указан срок действия. 
        Проверьте правильность введенных данных карты или воспользуйтесь другой картой
    ''',
    5057: 'Ограничение на карте. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5065: 'Превышен лимит операций по карте. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5075: 'Превышено количество неправильных вводов PIN. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5082: 'Неверно указан код CVV',
    5091: 'Эмитент недоступен. Повторите попытку позже или воспользуйтесь другой картой',
    5092: 'Эмитент недоступен. Повторите попытку позже или воспользуйтесь другой картой',
    5096: 'Ошибка банка-эквайера или сети. Повторите попытку позже',
    5204: '''
        Операция не может быть обработана по прочим причинам. 
        Свяжитесь с вашим банком или воспользуйтесь другой картой
    ''',
    5206: '3-D Secure авторизация не пройдена. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5207: '3-D Secure авторизация недоступна. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5209: '3-D Secure авторизация недоступна. Свяжитесь с вашим банком или воспользуйтесь другой картой',
    5300: 'Лимиты эквайера на проведение операций. Воспользуйтесь другой картой',
}
